[
  {
    "path": "posts/2021-07-27-isss608-assignment-1-part-1/",
    "title": "ISSS608 Assignment 1 Part 1",
    "description": "This post is a submission for ISSS608 Assignment 1, Vast Challenge 2 part 1",
    "author": [
      {
        "name": "Yeo Chia Guan Andy",
        "url": {}
      }
    ],
    "date": "2021-07-27",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-27T10:17:42+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-27-isss608-assignment-1-part-2/",
    "title": "ISSS608 Assignment Part 2",
    "description": "This post is a submission for ISSS608 Assignment 1, Vast Challenge 2 part 2",
    "author": [
      {
        "name": "Yeo Chia Guan Andy",
        "url": {}
      }
    ],
    "date": "2021-07-27",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nReading layer `Abila' from data source \r\n  `C:\\yeochiaguan\\DataViz\\_posts\\2021-07-27-isss608-assignment-1-part-2\\data\\Geospatial' \r\n  using driver `ESRI Shapefile'\r\nSimple feature collection with 3290 features and 9 fields\r\nGeometry type: LINESTRING\r\nDimension:     XY\r\nBounding box:  xmin: 24.82401 ymin: 36.04502 xmax: 24.90997 ymax: 36.09492\r\nGeodetic CRS:  WGS 84\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nVehicle Movement by Employment Type\r\nWhen we look at the pathings by Employment Type, we see a different picture. As observed below, the Employment Type “Missing”, which represents trucks (as identified with id > 100), showed a peculiar route taken. Vehicle ID 107 could be seen travelling pass Pilau Park to Velestinou Boulevard. Vehicle ID 29 from Facilities could also be seen travelling to unique places during the period.\r\n\r\npreservea7df6e007ccc57dd\r\n\r\n4.2 Finding Patterns from Patronage and Vehicle Data\r\nNext, we’ll try and identify the possible owners of the credit card and loyalty card by filtering the location by date and time. For the below charts, we filter the vehicle data to show the vehicle locations by hour, specifically on 6 Jan 2014. The method applied was to identify the vehicle id which was present in on the map on a specific hour and cross-reference it to the paronage dataset to identify the credit card transaction made as well as the location.\r\n\r\npreserve96782fbd35e0b036\r\n\r\n\r\npreserve64341fe81a3462f7\r\n\r\nIsolated credit card transactions\r\nThe below observations using isolated cases could be made using the data from 6 Jan 14:\r\ntime (hr)\r\nVehicle ID\r\nLocation\r\nlast4ccnum\r\n9\r\n101\r\nKronos Pipe\r\n9220\r\n10\r\n101\r\nMaximum Iron\r\n9220\r\n10\r\n107\r\nNationwide Refinery\r\n9735\r\n15\r\n104\r\nAbila Airport\r\n8642\r\n20\r\n19\r\nShoppers\r\n7688\r\nThe steps above was repeated for all dates to obtain the below list of identified vehicle id, tagged to a credit card number. The rest of the data was not complete as during the process, several of the credit cards were found to be used at a shop where a different vehicle was driven instead. hence the echnique was found to be lacking in terms of the accuracy.\r\nVehicle ID\r\nlast4ccnum\r\n1\r\n2681\r\n10\r\n1321\r\n12\r\n2418\r\n13\r\n9735\r\n14\r\n5368\r\n19\r\n7688\r\n21\r\n8156\r\n24\r\n9152 1877\r\n32\r\n7688\r\n34\r\n2681\r\n35\r\n9551\r\n101\r\n9220\r\n104\r\n8642\r\n105\r\n7792\r\n107\r\n9735\r\n5.0 Future Works\r\nAs part of the future work, the network visualisation could be explored to match the credit card transactions to the vehicle id to identify the owners.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-27T10:25:58+08:00",
    "input_file": "isss608-assignment-1-part-2.knit.md"
  },
  {
    "path": "posts/2021-06-10-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "This is my submission for the Data Viz Makeover Assignment 2 for ISSS608 Visual Analytics and Applications",
    "author": [
      {
        "name": "Yeo Chia Guan Andy",
        "url": "https://github.com/yeochiaguan"
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\r\nContent\r\n1.0 Original Visualization\r\n2.0 Critic and Suggestion for current graph\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3.0 Proposed Design\r\n4.0 Data Preparation\r\n4.1 Remove Unused Rows and Columns\r\n4.2 Renaming Sheet\r\n4.3 Drawing Relationship\r\n4.4 Data Processing\r\n\r\n5.0 Building the Visualization\r\n6.0 Final Output\r\n6.1 Insights\r\n\r\n1.0 Original Visualization\r\nThe data visualization below is created using the data provided by Department of Statistics, Singapore (DOS) on the Merchandise Trade by Region/Market. The visualization shows the value of import and export in Singapore with each trading partner represented by two areas on the visualization which represents higher proportion of either import or export value.\r\n\r\n2.0 Critic and Suggestion for current graph\r\n2.1 Clarity\r\nS/N\r\nCritic and Suggestion\r\n1\r\nMain Highlight not shown on Visualization: The highlight of the visualization compares the values of exports and imports for Singapore’s merchandise trade with Mainland China in 2009 and United States in 2006 but it was not indicated on the visualization. The comparison can be made for the two countries on the same year 2006 or 2009 instead of comparing across two different years.\r\n2.\r\nOverlapping Data Points: The size of the bubbles which was meant to reflect the total merchandised trade value with trading partners ended up overlapping with other data points. Notably, the plot for merchandised trade with japan can be seen covering a large portion of the data including the centre point for the Republic of Korea. Similar can be seen for EU, Malaysia and Taiwan. Transparency can be applied to the data points allow the centre point of other data to be seen in the event of an overlap.\r\n3.\r\nUnclear visualization for Top Import and Export: The visualization showed that the top exporter was Hong Kong and top importer was Taiwan based on the labels. However, the total merchandised trade for both import and export was shown to be Mainland China based on the plot. The top importer and exporter should be labeled by year. Else, the overall net import and export value should be considered instead.\r\n4.\r\nUnoptimised use of Labels: The labels for each data point could be better placed by setting it as tool tips indicating the individual export and import values for each trading partner. The labels could include the individual import and export values respectively.\r\n2.2 Aesthetics\r\nS/N\r\nCritic and Suggestion\r\n1.\r\nData too cluttered: The visualization is too cluttered with overlapping data points hence making it difficult to see the data points clearly like how the United States data was covering the EU data, together with some transparency for overlapping data points.\r\n2.\r\nMissing Axis Labels: The major units are not shown on the import and export axis, making it hard for readers to read the major units. A faint grideline could be added into the chart to improve the visuals and allow readers to reference to the major units on the import and export axis\r\n3.\r\nMessy Plot Labels: The labels for each trading partner are inconsistently placed on the chart with label for United States placed over the plot for EU and Taiwan. The Labels should be placed in a way that it is shown only when required (like placing the mouse cursor over the plot, or placed consistently below each plot itself.)\r\n3.0 Proposed Design\r\nNoting the weaknesses of the original design, the below design is proposed instead to address the weakness in Clarity and Aestatics.\r\nFigure 1. Proposed Design Sketch\r\nDesign Objective\r\nS/N\r\nProposed Design Objective\r\n1\r\nThe proposed design intends to show the import against export for each country under a single chart for better clarity on the relative position, thus avoiding the issue of charts misalignment\r\n2\r\nThe proposed design will show the import and export data for 2019 and 2020 separately to show the changes in relative position for each country from 2019 to 2020.\r\n3\r\nThe proposed design will provide more details on the exact import and export values for each country for each year.\r\n4.0 Data Preparation\r\nThe data is taken from the Department of Statistics, Singapore (DOS) on the Merchandise Imports and Exports by Region/Market. The .xlsx file contains the import and export data for each trading partner split into worksheet T1 and T2 respectively.\r\n4.1 Remove Unused Rows and Columns\r\nAs we are looking at the merchandised trade from Jan 2011 to Dec 2020, the below were removed.\r\nSteps\r\nReference Image\r\nRemove Top 5 Rows\r\n\r\nRemove Footnote\r\n\r\nRemove data from 1976 to 2010\r\n\r\nRemove data from 2021\r\n\r\n4.2 Renaming Sheet\r\nFor better clarity, the excel sheets for import and export were renamed accordingly. This is done so that it will be clearer when the data is imported into Tableau.\r\nFigure 6. Renaming the excel sheets\r\n4.3 Drawing Relationship\r\nWhen the file was initially loaded onto Tableau, the import and export data will need to be linked using the common field “variable”. In this case we link the Variables from both tables which represents each country. To do so, we click and drag the Import and Export Sheets into the top area as shown below and link .\r\nFigure 7. Drawing Relationship by Trading Partners\r\n4.4 Data Processing\r\nThe data from 2011 to 2020 was pivoted to column form and tagged to the respective trading partners. The data types were changed to the correct data type and new calculated field was created to reflect the actual export value. The below steps were done for both the import and export data.\r\nSteps\r\nReference Image\r\nEdit Data Type for Import and Export Values\r\n\r\nPivot Data from 2011 to 2020\r\n\r\nChange Data Type of Month-Year from String to Date\r\n\r\nSplit Trading Partner Names and Units\r\n\r\nCreate Calculated Field for Export Value\r\n\r\nRemove Unused Columns\r\n\r\nRenamed Columns to better reflect the data\r\n\r\nRepeat above steps for Import Data\r\n\r\nInclude the Month-Year variable in the relationship\r\n\r\n5.0 Building the Visualization\r\nTo create the proposed data visualization design, the below steps were taken. As we are interested to know the import and export for each trading partners individually, we exclude the values for the following : 1) Africa, 2) America, 3) Asia, 4) Europe, 5) European Union, 6) Oceania, 7) Total Merchandise Export, 8) Null. There were also trading partners with only import or export but not both (Example:New Caledonia, Norfolk Island etc.). These trading partners will be excluded from the visualization.\r\nSteps\r\nReference Image\r\nPlot the Export Value and Import Value with the Trading Partners (Export) as the level of details.\r\n\r\nApply filter to see the export and import value for each trading partner by years.\r\n\r\nSelect all the years to be added into the filter.\r\n\r\nShow filter to enable interactivity for the users on the right side of the dashboard/sheet.\r\n\r\nOn the right, a new tab will appear. Switch the filter type to Single Value(list).\r\n\r\nAdd Trading Partners into Filters to enable user input to filter data to his needs. (Example including/excluding regions into the analysis)\r\n\r\nAdd Trading Partners into the Color.\r\n\r\nCreate a Set for top 10 Trading Partners for Export by Export Value. Repeat for Top 10 Import\r\n\r\nCreate a new Calculated Field Total Trade\r\n\r\nCreate a Set for top 10 Trading Partners in terms of total trade.\r\n\r\nAdd the top 10 import and export trading partners into the filters and total trade vaue into the size.\r\n\r\nEnable the option to see the set. Show filter after showing the set.\r\n\r\nSwitch the filters to Single Value (ist) for the set for top 10 import/export. Leave the Trading Partner filter as multiple values (list)\r\n\r\nAdding Ranking to Trading Partners\r\n\r\nAdding dimensions and measures into tooltip to be included in the write-up later.\r\n\r\nChange the computation for ranking. Apply to import, export and total trade rank.\r\n\r\nImproving the Tooltips by adding more details relatng to the data.\r\n\r\nAdd Labels to improve clarity to the data poits.\r\n\r\nChange the currency format for Total Trade, Import and Export to improve clarity on the values.\r\n\r\nAdd Animation to the dashboard to improve user experience when applying filters\r\n\r\nTitle of the chart was renamed to Import vs Export of Trading Partner.\r\n\r\nCreate another sheet and add box plot for additional information. Use only the Total Trade as the Row input.\r\n\r\nAdd Action to the Dashboard for interactivity between the newly created boxplot and the scatterplot.\r\n\r\n6.0 Final Output\r\nWith the set filters in place, there is an option to see the top 10 import or export trading partners. For the analysis, we exclude the regions and trading partners with only import or export and keep those with both export and import values. We could also use the filter on the right to toggle the year to observe the import and export for each trading partner by year.\r\n\r\n6.1 Insights\r\nWith the new Data Visualization, three major observations were made below.\r\nS/N\r\nObservations\r\n1\r\nFrom year 2011 to 2012, Malaysia was the top Import and Export Partner for Singapore with a total Trade of $113B and $115B respectively. China was second place until year 2013 where CHina caught up with Malaysia in Total Trade and subsequently overtook Malaysia in being Singapore’s top trading partner and maintained first place till year 2020.\r\n2\r\nHong Kong was ranked consistently high in terms of Export with a yearly export value of above $60B but was consistently low on Import of approximately $5B .\r\n3\r\nThe top 7 Trading Partners for both Import and Export are consistentthroughout the years namely, but not in order: 1) Malaysia, 2) china, 3) United States, 4) Japan, 5) Republic of Korea, 6) Taiwan, 7) Indonesia. For Export, Thailand, Austrailia and Hong Kong makes up the top 10, while for Import, Germany, United Arab Emirates and Saudi Arabia makes the top 10.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T14:23:54+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-23-dataviz-makeover-1/",
    "title": "DataViz Makeover #1",
    "description": "This is my submission for the Data Viz Makeover Assignment for ISSS608 Visual Analytics and Applications",
    "author": [
      {
        "name": "Yeo Chia Guan Andy",
        "url": "https://github.com/yeochiaguan"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\nContent\r\n1.0 Original Visualization\r\n2.0 Critic and Suggestion for current graph\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3.0 Proposed Design\r\n4.0 Data Preparation\r\n4.1 Remove Unused Rows\r\n4.2 Removing Unused Columns\r\n4.3 Renaming Sheet\r\n4.4 Edit Relationship\r\n4.5 Edit Data Type\r\n4.6 Pivot Data\r\n\r\n5.0 Building the Visualization\r\n5.1 Details and Labels\r\n5.2 Tooltip\r\n5.3 Improving Clarity in Values and Percentage Change\r\n\r\n6.0 Final Output\r\n6.1 Insights\r\n\r\n1.0 Original Visualization\r\nThe data visualization below is created using the data provided by Department of Statistics, Singapore (DOS) on the Merchandise Trade by Region/Market. The visualization shows the import and export for the top six trading countries from 2019 to 2020.\r\n\r\n2.0 Critic and Suggestion for current graph\r\n2.1 Clarity\r\nS/N\r\nCritique\r\nSuggestion\r\n1\r\nThe line chart for the import and export for each region is not clear as the colors are overlapping one another. An example is the export for Mainland China where the lines are covered by the import.\r\nLine graph with no fill can be used instead to prevent overlapping of colors\r\n2\r\nThere is no clear intent of the charts. The charts merely shows two lines on the trend of the import and export for each region without a clear intent where the comparison was.\r\nThe key points of the charts can be highlighted. An example will be to indicate the value of the highest export or import for each region for a particular year.\r\n3\r\nThe scale of the charts are inconsistent for each country. Mainland China has a upper bound for the export at 8M and import at 6M while Taiwan has a upper bound of export at 2M and export at 4M.\r\nThe scales should be consistent for each chart to clearly show the difference between each region.\r\n4\r\nThere is a mismatch between data and the title where the title labeled the chart to be the Merchandised Trade of Top Six Trading Countries from 2019 to 2020, but the data shows till 2021.\r\nThe charts should be consistent to show data for the same period.\r\n2.2 Aesthetics\r\nS/N\r\nCritique\r\nSuggestion\r\n1\r\nThe line chart for the export for each region are covered by the import due to the colors fill. An example is the export for Mainland China where the lines are covered by the import.\r\nLine graph with no fill can be used instead to prevent overlapping of colors\r\n2\r\nThe width of the charts are inconsistent and misaligned when comparing for each country. An example would be Taiwan which has a smaller width as compared to Mainland China.\r\nThe width can be kept consistent for each chart.\r\n3\r\nThe import and export labels are not easy to read with the scales on the left and right side of the chart\r\nThe import data can be plotted against the export for each country for each year from 2019 to 2020 with the values shown on the data point\r\n3.0 Proposed Design\r\nFigure 1. Proposed Design Sketch\r\nDesign Objective\r\nS/N\r\nProposed Design Objective\r\n1\r\nThe proposed design intends to show the import against export for each country under a single chart for better clarity on the relative position, thus avoiding the issue of charts misalignment\r\n2\r\nThe proposed design will show the import and export data for 2019 and 2020 separately to show the changes in relative position for each country from 2019 to 2020.\r\n3\r\nThe proposed design will provide more details on the exact import and export values for each country for each year.\r\n4.0 Data Preparation\r\nThe data is taken from the Department of Statistics, Singapore (DOS) on the Merchandise Imports and Exports by Region/Market.\r\n4.1 Remove Unused Rows\r\nWithin the excel sheet, the rows 1 to 5 are do not contain any useful data for both the import and export data, hence these rows are removed. In addition, as we are interested in improving the original Visualization, only the top 6 countries 1) Hong Kong, 2) Mainland China, 3) Japan, 4) Malaysia, 5) Taiwan and 6) US, not sorted in any order are kept, while data from the other countries are excluded.\r\nFigure 2. Removing All Rows Less Top 6 Countries\r\nFigure 3. Table with Top 6 Countries\r\n4.2 Removing Unused Columns\r\nTo ensure that the data is insistent with the title and intent, data from year 2019 to 2020 were kept for analysis, while data from the other years are excluded.\r\nFigure 4. Removing Unused Columns\r\nFigure 5. Resulting Table\r\n4.3 Renaming Sheet\r\nFor better clarity, the excel sheets for import and export were renamed accordingly. This is done so that it will be clearer when the data is imported into Tableu.\r\nFigure 6. Renaming the excel sheets\r\n4.4 Edit Relationship\r\nWhen the file was initially loaded onto Tableau, the import and export data will need to be linked using the common field “variable”. In this case we link the Variables from both tables which represents each country.\r\nFigure 7. Edit Relationship to be by Variable Data Field\r\n4.5 Edit Data Type\r\nIt was also found that the Import and Export for each country were of string data type. This was not correct was the values should be numeric, thus the data type was amended accordingly.\r\nFigure 8. The Import and Export amount changed from String to Numeric Data Type\r\n4.6 Pivot Data\r\nThe data from 2019 to 2020 was pivoted to column form and tagged to the respective countries. This was done for both the import and export data. The data type for the pivot table was also changed to date datatype. The Headers were also renamed to “Countries”, “Month-Year” and “Import(Thousands)” respectively. The steps were repeated for the export data.\r\nFigure 9. Selected Columns to apply Pivot\r\nFigure 10. Changing headers and data types\r\nFigure 11. Update Relationship for Countries and Month-Year\r\n5.0 Building the Visualization\r\nOn Sheet 1, place the “Month-Year” and “Import (Thousands)” onto the columns and “Export (Thousands)” onto the rows.\r\nFigure 12. Place the Dimension and Measures onto the rows and columns\r\n5.1 Details and Labels\r\nThe “Country” measure was applied as the labels and details, the marks was changed to “circle” and the size was adjusted slightly smaller with the result as shown.\r\nFigure 13. Adding Details and Labels to the charts\r\nFor this Data Viz Makeover, we want to provide better clarity to the audience on the Import and Export Value, as well as the relative ranking for each Country.\r\nHence, a new calculated field “Rank by Import” and “Rank by Export” were created using the RANK_DENSE() function with the below expression. The\r\nFigure 14. Accessing add Calculated Field function\r\nFigure 15. Expression for Rank_Dense\r\n5.2 Tooltip\r\nThe tooltip adds additional information to the charts to send a clearer message. Information of interest such as the country, import and export amount as well as the respective ranks are added into the tooltip. To add in the newly created Calculated Field into the tooltip, both of the calculated fields are dragged into the “tooltip” and compute using “Country”.\r\nFigure 16. Adding Ranks into Tooltip\r\nThe calculated fields are added into the tool tip via the insert function. The description was amended to tell a story.\r\nFigure 17. Details in Tooltip amended to tell a Story\r\n5.3 Improving Clarity in Values and Percentage Change\r\nAt the current state, the import and export values could be confusing to the audience with values like “60M thousand”, so the values needed to be adjusted. The data provided was originally in thousands, so we will need to manually create a new calculated field Export Value and Import Value to show the actual export and import not in units of thousands. The Rank by Export and Rank by Import calculated field would also need to be amended accordingly using the Export (Value) and Import (Value) fields.\r\nFigure 18. Create New Calculated Field “Export (Value)”\r\nFigure 19. Replace Rows and Columns with New calculated Fields\"\r\nThe format of the Import and Export needed to be changed for better user experience. To do so, the Import and Export were changed under the Pane tab and the Numbers changed to Currency (custom) with display unit in Billions.\r\nFigure 20. Format Changed to Show Import in Billions\r\nWe are interested to find out the change in Import and Export for each country. To do do, we created new calculated fields Pct Change (Import) and Pct Change (Export) using the values from Import (Value) and Export (Value) and applied the Percentage Difference under Quick Table Calculation\r\n *Figure 22. Pct Change\r\nThe percentage change was inserted into the Tooltip.\r\n *Figure 23. Updated Tooltip with New Calculated Fields\r\n6.0 Final Output\r\nTo improve the aesthetics of the visualization, different colors are assigned to each country for ease of comparing the relative position of the country in 2019 and 2020. Gridlines were also made fainter in contrast to increase emphasis on data points. The field label Month-Year was also hidden.The final sheet was placed onto the dashboard as shown below.\r\nFigure 24. Final Output Visualization\r\n6.1 Insights\r\nWith the new Data Visualization, three major observations were made below.\r\nS/N\r\nObservations\r\n1\r\nMainland China had the highest Merchandised Trade in 2019 and 2020 with Import and Export over $65B and $70B respectively.\r\n2\r\nHong Kong was consistently the Rank of 6th in Import but maintained a Rank of 2 in Export.\r\n3\r\nTaiwan had the highest growth among the top six countries with an increase in Import and Export of 13.36% and 12.42% respectively.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T14:59:32+08:00",
    "input_file": {}
  }
]
